let card = document.querySelector('.cardContainer');
let nextButton = document.getElementById('nextButton');
let frontText = document.getElementById('frontText');
let backText = document.getElementById('backText');
let front = document.querySelector('.front');
let back = document.querySelector('.back');
let showButton = document.getElementById('showButton')
let previousListener;
let showButtonListener;
let pressed = 0;

card.addEventListener( 'click', function() {
  card.classList.toggle('is-flipped');
});


let data = [
  [`Органикалық қосылыстарға тән байланыс`, `Коваленттік байланыс`],
  [`Химиялық байланыс бір электрон жұбы арқылы пайда болғанда түзілетін байланыс`, `Дара(жай) байланыс`],
  [`Коваленттік байланыстың негізгі сипаттамалары`,`Полюстігі,байланыс ұзындығы,байланыс энергиясы, кеңістікте
  бағытталуы`],
  [`Молекуладағы атомдардың арасындағы байланыстың электрон тығыздығының ығысуымен сипатталады`,`Байланыс полюстігі`],
  [`Егер химиялық байланыс бір элемент атомдары немесе электртерістіктері бірдей элемент атомдарының арасында
  түзілсе,байланыс қандай болады`,`Полюссіз`],
  [`Егер байланыс электртерістіктері әртүрлі, бірақ электртерістіктерінің айырмашылықтары үлкен емес элемент атомдарының
  арасында түзілсе,онда байланыс түрі`,`Ковалентті полюсті`],
  [`Химиялық байланыс түзетін атомдар ядроларының арақашықтығы нанометрмен өлшенетін сипаттама`,`Байланыс ұзындығы`],
  [`Байланыс ұзындығы тәуелді`,`Оның еселігіне(+ байланыс түзетін атом табиғатына ау)`],
  [`C-C, C=C, C\u2261C ұзындықтары`,`0.154нм, 0.134нм, 0.120нм`],
  [`Байланыс беріктігінің өлшемі`,`Байланыс энергиясы`],
  [`Коваленттік байланыстың үзілуі екі түрлі өтеді`,`Гомолитті(симметриялы,радикалды) және
  гетеролитті(ассимметриялы,ионды)`],
  [`Бос радикалдар`,`Жұптаспаған электрондары бар бөлшектер`],
  [`Молекулаларының құрамы бірдей,бірақ химиялық құрылыстары әртүрлі заттар`,`Изомерлер`],
  [`Органикалық қосылыстар көміртек қаңқасына байланысты 2ге бөлінеді:`,`ашық тізбекті алифатты(ациклді) және тұйық тізбекті циклді`],
  [`Функционалдық топ`,`органикалық қосылыстың класын анықтайтын атомдар немесе атом топтары`],
  [`молекула құрамындағы көміртек атомдары өзара тек дара σ-байланыстар арқылы байланысқан жалпы
  формуласы СпН2п+2 болатын алифатты қаныққан көмірсутектер`,`алкандар`],
  [`Алкандарды басқаша атаулары`,`парафиндер,метан қатарының көмірстектері`],
  [`Гомолог дегеніміз`,`Жалпы формулалары бірдей,химиялық қасиетері ұқсас, ал құрамдары бір немесе бірнеше СН2 тобына
  өзгеріп отыратын заттар`],
  [`Алкан көмірсутектерінен бір сутек атомы үзілгенде түзіледі`,`алкил, радикал түрі`],
  [`Алкандардың изомерленуі қай алканнан басталады`,`Бутаннан`],
  [`Қаныққан көмірсутектердің ең қарапайым өкілі`,`метан`],
  [`Қ.ж.-да газ күйіндегі алкандар`,`метан, этан, пропан, бутан`],
  [`Метанның галогендену реакциясының механизмі`,`Бос радикалды механизм`],
  [`Метанды жоғары температурада 1000°С шамасында ауа қатыстырмай қыздырғанда`,`Жай заттарға ыдырайды`],
  [`Метанды 1500°С шамасында қыздырғанда`,`Ацетилен мен сутек түзіледі`],
  [`Метанның гомологтарының жоғары температурада көміртек атомдарының сандары азырақ көмірсутектерге ыдырауы`,`Крекинг`],
  [`Алкандардың изомерлену процесі қай өршіткі қатысында жүреді`,`AlCl${toSub('3')}`],
  [`Шахталарда қопарылыс туғызады`,`Метан`],
  [`Алкардарға әсер етпейтін күшті тотықтырғыштар`,`KMnO${toSub('4')},K${toSub('2')}Cr${toSub('2')}O${toSub('7')}`],
  [`Изооктан ИЮПАК бойынша атауы`,`2,2,4-триметилпентан`],
  [`Өсімдіктердің сүтті шырындарында кездеседі`,`табиғи көксағыз`],
  [`Қанықпаған көмірсутектің полимері (С${toSub('5')}Н${toSub('8')})${toSub('n')}`,`табиғи көксағыз`],
  [`Қолайсыз қасиеттерін жою үшін көксағызды вулканизациялап(вулкандап) күкірт қосу арқылы алады`,`резеңкені`],
  [`Көксағызды вулканизациялағанда оның массасының -2-3%-ындай қосатын зат`,`күкірт`],
  [`Егер күкірт резеңкеге қажетті мөлшерден көбірек қосылса онда созылмайтын қатты зат`,`эбонит алынады`],
  [`Таскөмірді ауа қатыстырмай кокс пештерінде 900-1050С өдеу әдісі`,`таскөмірді кокстеу`],
  [`“ағаш спирті”`,`метанол`],
  [`Этиленгликольді қату темп төмен болғандықтан автомобильдердің
  радиаторына құятын ,қыста қатпайтын сұйық зат-...... дайындау үшін пайдаланады`,`антифриз`],

]





function App() {
  let randQuestion = getRandomItem(data);
  if (card.classList.contains('is-flipped')) {
    back.classList.remove('makeBack');
    back.classList.add('makeFront');
    backText.innerHTML = randQuestion[0];
    front.classList.remove('makeFront');
    front.classList.add('makeBack');
    frontText.innerHTML = randQuestion[1];
  } else {
    front.classList.remove('makeBack');
    front.classList.add('makeFront');
    frontText.innerHTML = randQuestion[0];
    back.classList.remove('makeFront');
    back.classList.add('makeBack');
    backText.innerHTML = randQuestion[1];
  }
}


function toSup(a) {
  return a.sup();
}

function toSub(a) {
  return a.sub();
}






function handleButtonClick() {
  pressed = 0;
  if (previousListener) {
    nextButton.removeEventListener('click', previousListener);
  }

  App();

  previousListener = () => {
    handleButtonClick();
  };
  nextButton.addEventListener('click', previousListener);
}

handleButtonClick();

function getRandomItem(arr) {

  // get random index value
  const randomIndex = Math.floor(Math.random() * arr.length);

  // get random item
  const item = arr[randomIndex];

  return item;
}